[{"model": "website.image", "pk": 1, "fields": {"image": "uploads/images/IMG_3697.JPG", "uploader": 1, "description": "Director and Founder", "date_added": "2017-05-08T21:20:30Z"}}, {"model": "website.image", "pk": 2, "fields": {"image": "uploads/images/Flag_of_Somalia_6QEQTMO.png", "uploader": 1, "description": "Flag of Somalia", "date_added": "2017-05-08T21:28:03Z"}}, {"model": "website.image", "pk": 3, "fields": {"image": "uploads/images/Flag_of_Djibouti.png", "uploader": 1, "description": "Flag of Djibouti", "date_added": "2017-05-08T21:31:51Z"}}, {"model": "website.image", "pk": 4, "fields": {"image": "uploads/images/Flag_of_Ethiopia.png", "uploader": 1, "description": "Flag of Ethiopia", "date_added": "2017-05-08T21:34:46Z"}}, {"model": "website.image", "pk": 5, "fields": {"image": "uploads/images/Flag_of_Kenya.png", "uploader": 1, "description": "Flag of Kenya", "date_added": "2017-05-08T21:37:23Z"}}, {"model": "website.image", "pk": 6, "fields": {"image": "uploads/images/Flag_of_Uganda.png", "uploader": 1, "description": "Flag of Uganda", "date_added": "2017-05-08T21:39:29Z"}}, {"model": "website.image", "pk": 7, "fields": {"image": "uploads/images/Flag_of_Eritrea.png", "uploader": 1, "description": "Flag of Eritrea", "date_added": "2017-05-08T21:41:14Z"}}, {"model": "website.page", "pk": 1, "fields": {"name": "Services", "title": "Services", "paragraphs": "ESDI stands in the forefront of the international effort to restore the habitability of the Horn of Africa. We offer our clients contextualized information that take into account the intricate relationship between the environment, social values and governance systems in the region. We provide our clients and local governments both sectoral and integrated knowledge that can inform public policy and guide strategic interventions. \r\n\r\nWhile enhancing regional knowledge, we empower the peoples of the region through education and capacity building training. We provide them the tools necessary to identify the drivers of instability in the region, and show them how to tackle them.\r\n\r\n#### We offer our clients and the local stakeholders seminars and workshops on: \r\n\r\n+ Risk mitigation strategies \r\n+ Practical adaptation and coping methods \r\n+ Institution building \r\n+ Good governance \r\n+ Conflict resolution \r\n+ Sustainable community development", "image": null, "author": 1}}, {"model": "website.page", "pk": 2, "fields": {"name": "Consultants", "title": "Consultants", "paragraphs": "ESDI strives to restore the traditional eco-social balance that is essential for the stability of the Horn of Africa. \r\n\r\n\r\nOur consultants possess keen knowledge of the natural and man-made forces that keep upsetting this crucial balance. They monitor the unique ways that these can align in any particular country at any given time, and devise workable interventions. \r\n\r\n\r\nAs experts, they provide both conceptual and practical solutions to the chronic problems of the region: \r\n\r\n+ Environmental degradation; \r\n+ Political and social factionalism; \r\n+ Weak public institutions; \r\n+ Lack of food security, and \r\n+ Mass migration. \r\n\r\nESDI is keen on sustainable development and provide policy framework that can assist our clients to achieve positive results.", "image": null, "author": 1}}, {"model": "website.page", "pk": 3, "fields": {"name": "Clients", "title": "Clients", "paragraphs": "This page will list our clients, who agree their names to be listed.", "image": null, "author": 1}}, {"model": "website.page", "pk": 4, "fields": {"name": "Contacts", "title": "Contact us", "paragraphs": "For any queries contact\r\n\r\n+ **mahadallah@ecosocialdynamics.com**\r\n+ OR \r\n+ **mahadallah@gmail.com**", "image": null, "author": 1}}, {"model": "website.person", "pk": 1, "fields": {"name": "Hassan O. Mahadallah, PhD", "shortname": "Hassan-Mahadallah", "short_description": "Director and Founder", "photo": 1, "long_description": "Curriculum Vitae\r\n\r\n### Professional Preparation\r\n\r\n\r\n+ PHD – 1997 Tulane University, New Orleans, Louisiana\r\n+ MA – 1985 Baylor University, Waco, Texas\r\n+ BA –1983 Rust College, Holly Springs, Mississippi\r\n\r\n### Appointments\r\n\r\n\r\n+ 2010 – Present Professor, Dept. of Political Science -- SUBR\r\n+ 2009 – 2010\tInterim chair, Dept. of Public Administration– SUBR\r\n+ 2005 – 2010 Assoc. Prof., Dept. of Political Science – SUBR\r\n+ 1998 - 2005 Asst. Prof., Dept. of Political Science – SUBR\r\n+ 1995 – 1998 Visiting Prof., Dept. of Political Science – SUBR\r\n+ 1992 – 1995 Adj. Prof., Evening and Weekend College – SUNO\r\n\r\n### Sample of Publications\r\n\r\n\r\n1.\t“History of Somalia’s Armed Forces,” in Kurt Piehler, ed., Encyclopedia of Military Science (Sage), forthcoming\r\n2.\t“Continuity and Change in U.S. Foreign Policy,” Horn of Africa, Vol. 27 (2009), pp. 36-63.\r\n3.\t“Islamic Courts, Ethiopia’s Intervention in Somalia, and Its Implications for Regional Stability,” Horn of Africa, Vol. XXV (2007), pp. 135-164.\r\n4.\t“Pithless Nationalism: The Somali Case,” in Abdi Kusow, ed., Putting the Cart Before the Horse (Trenton, NJ: Red Sea Press, 2004), pp. 59-74.\r\n5.\t“American Political Parties,” in D. Grier Stephenson, et al, Understanding American government (Redding, CA: Horizon Textbook Publishing, 2005).\r\n\r\n\r\n### Sample of Research Presentations“\r\n\r\n\r\n1.\t“Effective Leadership and the Sustainability of the African State,” a paper presented at The First International Leadership Conference, Kampala, Uganda, 16-19 June 2010\r\n2.\t“Political Leadership in the Horn of Africa,” a paper presented at The Nordic African Institute, Uppsala, Sweden, 25-26 May 2010.\r\n3.\t“Challenges of Sustainability in the Horn of Africa,” a paper presented at the Seventh International Conference on Public Management, Policy and Development, Accra, Ghana, 13-24 June 2009.\r\n4.\t“Regional Determinants of U.S. Foreign Policy in Africa,” a paper presented at the King-Mandela Symposium, University of Georgia, fall, 2008.\r\n5.\t“Unsustainable Trends in the Horn of Africa,” a paper presented at the 2007 Triennial Conference of the Somali International Studies Association (SISA), Djibouti, Republic of Djibouti, 13-15 December 2007.\r\n\r\n### Synergistic Activities\r\n\r\nNelson Mandela School of Public Policy and Urban Affairs: Dr. Mahadallah is an IGERT Professor and teaches Sustainability in the Ph.D. program. The IGERT program is a collaborative program between Southern University and Michigan Tech University. The mission of the programs is train graduate students in sustainability and multi-disciplinary decision making and education."}}, {"model": "website.person", "pk": 2, "fields": {"name": "Mohamed Hussein", "shortname": "Mohamed-Hussein", "short_description": "Consultant", "photo": 1, "long_description": "Curriculum Vitae\r\n\r\n### Mohamed Hussein\r\n\r\nExperienced in addressing the root causes of Somalia's social, economic and political instabilities.\r\noptimasoma@gmail.com\r\n\r\n#### Experience\r\n\r\n**Consultant at OPTIMA LOCAL PRACTITIONERS CONSULTANCY**\r\nJune 2013 - Present (3 years 10 months)\r\nManaging Director\r\n\r\n**Senior Consultant at Addadly Electric Power** *August 2016 - September 2016 (2 months)*\r\n\r\nProvided consultancy services for Addedly Electric Power and produced concept paper, which was\r\nsuccessfully submitted on the behalf of the electricity provider compony to Development Alternative\r\nInitiatives (DAI).\r\n\r\n**Senior Consultant at Al Madina Hospital** *June 2016 - July 2016 (2 months)*\r\n\r\nProvided strategic consultancy through concept paper for Al Madina Hospital.\r\n\r\n**Lead Consultant at OPTIMA Somalia** March 2016 - May 2016 (3 months)\r\n\r\nThrough the promotion of inclusive markets, researched the best approach to creating value chain markets for\r\nSomalia fishery sector.\r\n\r\n**Lead Researcher at Addressing Root Causes Fund and (ARC) Consortioum** *February 2016 - February 2016 (1 month)*\r\n\r\nOn a short consultancy assignment, researched through context specific labor market analysis on the\r\nlead causes of current rampant youth unemployment and major drivers of social, economic and political\r\ninstabilities in South-Central regions of Somalia. The ARC/Consortium consisted Save the Children,\r\nSPARK, and Care Netherlands. Major findings of the labor market analysis provided to the ARC/Consortium\r\nprogram proposal option.\r\n\r\n**Consultant at Gargaar Organization** *January 2016 - February 2016 (2 months)*\r\n\r\nEvaluated the impacts a piloted vocational training activities under Gragaar SHGs program, supported by\r\nTearsFund.\r\n\r\n**Senior Consultant at Health Agro-Pastoralists Education Liaison (HEAL)** *December 2015 - January 2016 (2 months)*\r\n\r\nSuccessfully developed a concept paper on behalf of HEAL, which was approved and endorsed by CRC\r\nSomalia WASH Cluster. 2.Developed on behalf of HEAL a WASH proposal, which approved by Unicef/\r\nSomalia/WASH Section.\r\n\r\n**Seniro and Lead Consultant at SPARK** *August 2015 - October 2015 (3 months)*\r\n\r\nLead Researcher on Local Employment for African Development (LEAD) Program, Dutch Foreign Trade\r\nCooperation Affairs supported Programme in relation to creating sustainable local economic growth for\r\nsustainable employment for the Somali Youth.\r\n\r\n**Senior Consultant at Katuni Consult Cooperative (KCC)** *August 2014 - December 2014 (5 months)*\r\n\r\nLead Researcher on DFID Supported Research on: Exploring Strategy for Community-Driven Negotiated\r\nAccountability between District Level Structures and Citizens: An Operational Research Pilot Study\r\n\r\n**Lead Consultant at Katuni Consult Cooperative (KCC)** *May 2014 - August 2014 (4 months)*\r\n\r\nLead Researcher on 12 UNDP Supported Micro-Projects for Assessment Development Results (ADRs) on\r\nbehalf of UNDP Independent Evaluation Office (IEO) New-York, USA\r\n\r\n**Lead Consultant at Social Impact** *May 2013 - December 2013 (8 months)*\r\n\r\nLead Researcher in Somaliland and Puntland under Prime Contracts of Care Somalia Girls Education\r\nPromotion Program (SOMGEP) and Relief International Educate Girls, End Poverty Project\r\n\r\n**Senior Program Advisor at Health Education Agro-pastoralist Liaison (HEAL)** *September 2010 - April 2013 (2 years 8 months)*\r\n\r\nBuilt the overall capacity of HEAL staff, developed working strategies and concurrent plan-of action with\r\nvarious international partner organizations including the UN agencies such as UNDP/Somalia and UNICEF\r\nSomalia, developed various proposals regarding poverty reduction and community health and education\r\ndevelopments and was responsible the overall organizational growth of HEAL.\r\n\r\n**Lead Consultant at GARGAAR** *June 2011 - October 2012 (1 year 5 months)*\r\n\r\nMonitored the progress of Access to Basic Education project and evaluated Community Based Literacy and\r\nLivelihood Development (CBLLD) Project\r\n\r\n**Lead Consultant at Somali Consultants Association (SOCA)** *December 2009 - August 2010 (9 months)*\r\n\r\nAssisted the selection of sub-project proposals in regard to UNDP Employment Generation for Early\r\nRecovery (EGER) Program, monitored implementation activities of 8 Somaliland local partner organization\r\nwith the UNDP EGER Program, developed strategies and monitoring and evaluation framework for SOCA,\r\ndesigned and facilitated capacity building workshops for UNDP local partner organizations with the focus\r\non project planning, project monitoring and project evaluation , conducted various joint monitoring fieldtrips\r\nwith all stakeholders including the UNDP Hargeisa on the progress of all UNDP/EGER sub-projects,\r\ndesigned and facilitated various community meetings for UNDP/EGER sponsored sub-projects and prepared\r\nand produced weekly progress, midterm and project evaluation reports in relation to socioeconomic UNDP/\r\nEGER sub- projects outcomes and wider project impacts\r\n\r\n**Lead Consultant at Daryeel Bulsho Guud (DBG Somalia)** *March 2010 - May 2010 (3 months)*\r\n\r\nDesigned and facilitated strategic planning workshop for DBG, developed an updated DBG profile and\r\nbrochures of the organization, assisted the development of six months plan of action, designed and\r\nfacilitated capacity building workshop on various monitoring & evaluation methods and have produced\r\nemergency preparedness strategy and specific participatory monitoring & evaluation tools for DBG\r\n\r\n**Lead Consultant at Tools for Humanity (Tools4humanity)** *January 2009 - December 2009 (1 year)*\r\n\r\nCarried-out situational assessment on the viability of opening new office site in Hargeisa, Somaliland,\r\nestablished strong public relations with communities and with government and appropriate line-ministries,\r\nplanned/facilitated/reported several familiarization meetings and workshops about the core objectives of\r\nTools for Humanity and successfully situated Tools4 Humanity to operate in Somaliland\r\n\r\n**Research Coordinator and Program Advisor at Life and Peace Institute** *February 2008 - June 2008 (5 months)*\r\n\r\nProduced monthly situational analysis with possible scenarios, contributed and provided advice the\r\nappropriateness of the two year LPI Somalia Conflict Transformation Programme, undertook quarterly\r\nthorough conflict analysis in examining conflict dynamics and actors involved, undertook monitoring and\r\nevaluation the conflict transformation capacity building program for Somali civil society organizations and\r\nincreased the capacity of local partner organizations to undertake baseline research that included effective\r\nconflict analyses, monitoring and evaluating peacebuilding programs and building local partner’s capacity to\r\nengage specific themes for further peace advocacy\r\n\r\n**Senior Research Officer at Life and Peace Institute (LPI)** *June 2007 - January 2008 (8 months)*\r\n\r\nUndertook documentation research on the role of Somali women peacebuilding activities, undertook\r\nidentification and assessment activity of potential local partners and facilitated workshops for agents\r\nof change including Somali National Reconciliation Commission (NRC) and Baidoa Somali Women\r\nAssociation\r\n\r\n**Project Manager at Somali Peace Line (SPL)** *January 2007 - May 2007 (5 months)*\r\n\r\nManaged the project in accordance with project objectives ,monitored and insured project activities be\r\nimplemented, Produced monthly reports on project activities , produced periodic situational analysis\r\nundertook need assessment for newly IDPs in Mogadishu outskirts and facilitated peacebuilding workshops\r\nfor Benadir traditional elders\r\n\r\n**Lead Technical Consultant at Care Somalia and Southern Sudan** *February 2007 - March 2007 (2 months)*\r\n\r\nDeveloped and facilitated peace promotion workshops for Somali National Reconciliation Commission\r\n\r\n**Researcher at Broderskapsrörelsen-The Christian Social Democrats in Sweden** *December 2006 - January 2007 (2 months)*\r\n\r\nResearched on behalf of Broderskapsrörelsen “Major Challenges and Possibilities of the Somali Civil\r\nSociety” and presented findings in a workshop session under the workshop title Co-operation between\r\nSweden and Somalia with key stakeholders at Hotel Pan Africa Hotel in Nairobi, Kenya.\r\n\r\n\r\n_____\r\n\r\n**Summary**\r\n\r\n#### PROFESSIONAL PROFILE Summary\r\n\r\nRecently, and through indicative research, I have been working on how to create alternatives to humanitarian\r\naid in Somalia. Major findings include that it is possible to change currently channeling funds of the UN\r\nfor humanitarian aid and directly investing in the private sector and through creating debt less funding\r\nmechanism. One method is creating inclusive global markets and by enabling Somalia's markets with the\r\nprivate investments of both local and international investments.\r\n\r\nIn addition, I have a solid research background in which extensively researched on relief, recovery , and\r\ndevelopment-related interventions in Somalia including Somaliland. Major researched issues include\r\nresearching drivers of social, economic and political instabilities of Somalia.\r\n\r\nFurthermore, have effectively contributed the development of a relevant monitoring and evaluation\r\nframeworks. As the result, produced number of locally applicable survey instruments for qualitative and\r\nquantitative studies through household surveys, focus group discussions relating to food security, employment\r\ncreation, health, and education interventions.Due to 10 years of experience, I have developed new threshold\r\nthat addresses major drivers of such protracted violent conflict in Somalia. The core function of the developed\r\nthreshold is through identifying program stakeholders and creating effective linkages of such identified\r\nprogram stakeholders. Throughout my working experience, I also have documented major lessons learned on\r\npeacebuilding approaches, political economy and on sustainable local development. Major Goal: contributing\r\n\r\n\r\n### Languages\r\nLanguage  |  Proficiency\r\n--|--\r\nEnglish  |  (Native or bilingual proficiency)\r\nArabic  |  (Native or bilingual proficiency)\r\nSomali  |  (Native or bilingual proficiency)  \r\n\r\n### Skills & Expertise\r\n\r\n- Capacity Building\r\n- Research\r\n- Strategic Planning\r\n- Proposal Writing\r\n- Program Evaluation\r\n- International Development\r\n- Policy\r\n- Policy Analysis\r\n- Team Building\r\n- Project Planning\r\n- Civil Society\r\n- Program Management\r\n- NGOs\r\n- Government\r\n- Community Development\r\n- Nonprofits\r\n- International Relations\r\n- Strategy\r\n- Management\r\n- Project Management\r\n- Organizational Development\r\n- Public Relations\r\n- Leadership\r\n- Public Speaking\r\n- Microsoft Office\r\n- Solid Research Background\r\n- Undertook an study the potentials and specific\r\n- challenges of Somali civil societ\r\n- Researched the various roles of Somali women in\r\n- both peace and in conflict situa\r\n- Experienced with Participatory Action Research\r\n- (PAR) Research Methodology\r\n- Participated the evaluation of UNDP Somalia\r\n- Assessment Development Results (ADRs\r\n- Researched Good Governance Nexuses in Somalia\r\n- Produced concept papers on how best to close the\r\n- gap between theory and practic\r\n- Program Development\r\n- Fundraising\r\n- Qualitative Research\r\n- Report Writing\r\n- Public Policy\r\n- Analysis\r\n- Workshop Facilitation\r\n- Community Outreach\r\n- Training\r\n- Human Rights\r\n- Quantitative Research\r\n- Sustainable Development\r\n- Grants\r\n- Grant Writing\r\n- Governance\r\n- Teaching\r\n- Conflict\r\n- Politics\r\n\r\n\r\n# Education\r\n#### Brock University\r\nBachelor of Arts (B.A.), Sociology, 1996 - 2000\r\nActivities and Societies: Christian and Muslim Debates on religious tolerance and University Union\r\ndiscussions\r\n\r\n#### Brock University\r\nSociology , Sociology, 1996 - 2000\r\nActivities and Societies: Facilitated Christian and Muslim dialogue and worked with university student union\r\nassociation\r\n\r\n### Volunteer Experience\r\n**Researcher and associate of Somali Parent Liaison (SPL), a community based organization in Toronto at Ontario Board of Education** *2001 - Present*\r\n\r\nWorked as volunteer researcher with Ontario Board of Education of understanding why children of newly\r\nimmigrant parents are not obtaining meaningful education that insures retention on schools and thereby\r\nobtaining higher education\r\n\r\n**Volunteering Lecturer at SIMAD Institute** *2006 - Present*\r\n\r\nTaught as volunteer lecturer at SIMAD Institute in Mogadishu, Somalia on Social Research and on Business Ethics\r\n\r\n### Certifications\r\n**Bachelor of Humanity, Sociology**\r\nBrock University  - June 1996 to June 2004\r\n\r\n### Organizations\r\n**Office for Provisioning Technical Information & Manageable Advisory (OPTIMA)** -  *Co-founder*\r\n\r\nJune 2013 to Present\r\n\r\n**Coalition for Peace in Africa (COPA)** - *memership*"}}, {"model": "website.country", "pk": 1, "fields": {"name": "Somalia", "photo": 2, "short_description": "is located in the Horn of Africa, on the Indian Ocean coast", "long_description": "Somalia is located in East Africa and bordered Indian Ocean to the east, Kenya to the south, Ethiopia to the West, Djibouti to the north-west and Red Sea to north."}}, {"model": "website.country", "pk": 2, "fields": {"name": "Djibouti", "photo": 3, "short_description": "is located in East Africa, on the coast of Red Sea", "long_description": "Djibouti is located in the mouth of Bab-Al-Mandab, which is a channel between Yemen and Djibouti."}}, {"model": "website.country", "pk": 3, "fields": {"name": "Ethiopia", "photo": 4, "short_description": "is located in East Africa, on the highland of Habesha", "long_description": "Ethiopia is located in East Africa, and is land-locked country which has borders with Djibouti, Somalia, Kenya, South-Sudan, Sudan and Eritrea."}}, {"model": "website.country", "pk": 4, "fields": {"name": "Kenya", "photo": 5, "short_description": "is located in East Africa and is founding member of East African Community", "long_description": "Kenya is located in East Africa and has borders with Somalia, Tanzania, Uganda, South-Sudan and Ethiopia."}}, {"model": "website.country", "pk": 5, "fields": {"name": "Uganda", "photo": 6, "short_description": "is located in East Africa and is member of East African Community", "long_description": "Uganda is located in East Afica and has borders with South-Sudan, Kenya, Tanzania, Rwanda and Brundi."}}, {"model": "website.country", "pk": 6, "fields": {"name": "Eritrea", "photo": 7, "short_description": "is located in East Africa on the coast of Red Sea", "long_description": "Eritrea is located in East Africa and has borders with Sudan, Djibouti and Ethiopia."}}, {"model": "website.pagesection", "pk": 1, "fields": {"name": "esdi", "photo": null, "short_description": "Eco-social Dynamics International", "long_description": "ESDI: CONSULTANCY WITH LOCAL KNOWLEDGE AND A PASSION FOR A BETTER FUTURE"}}, {"model": "website.pagesection", "pk": 2, "fields": {"name": "featured1", "photo": null, "short_description": "experts", "long_description": "with local knowledge"}}, {"model": "website.pagesection", "pk": 3, "fields": {"name": "featured2", "photo": null, "short_description": "facts-based", "long_description": "WE MONITOR THE ECO-SOCIAL CHALLENGES"}}, {"model": "website.pagesection", "pk": 4, "fields": {"name": "featured3", "photo": null, "short_description": "deep understanding", "long_description": "for the people and their lifestyle"}}, {"model": "website.pagesection", "pk": 5, "fields": {"name": "esdi detail", "photo": null, "short_description": "EcoSocial Dynamics International (ESDI) is a USA-based private consultancy company that advises governments, international organizations, and private corporations in the Horn of Africa (HoA)", "long_description": "EcoSocial Dynamics International (ESDI) is a USA-based private consultancy company that advises governments, international organizations, and private corporations \r\nin the Horn of Africa (HoA) on how to improve the livelihood of the peoples of the region. Based on hard data, the region has many favorable eco-social systems that can comfortably \r\nsustain the population. However, despite its natural endowments, the HoA is one of the most inhospitable regions in the world.\r\n\r\n\r\nThe Horn of Africa is a tapestry of ecology and cultures that have traditionally complemented one another. In recent years new faulty lines have appeared in the tapestry—i.e., worsening state-society relations, dwindling resources, tribal wars, terrorism, and mass displacement of peoples. Left unaddressed for so many years, these have severely reduced the habitability of the HoA. Mass migration and internal displacement of peoples are common occurrences."}}, {"model": "website.pagesection", "pk": 6, "fields": {"name": "what we do", "photo": null, "short_description": "ESDI MONITORS THE DRIVERS OF ECO-SOCIAL CHALLENGES:", "long_description": "-\r\nClimate Change\r\n\r\nWeak governance systems\r\n\r\nOver exploitation of the commons\r\n\r\nSocial strife\r\n\r\nRecurrent famine"}}, {"model": "website.pagesection", "pk": 7, "fields": {"name": "how we do", "photo": null, "short_description": "IN DEVELOPING POLICY FRAMEWORK WE EMPHASIZES ON:", "long_description": "-\r\nEnvironmental rehabilitation\r\n\r\nProtection of the fragile ecology\r\n\r\nGood governance\r\n\r\nCapacity building\r\n\r\nInter-communal dialogue and reconciliation"}}]